Interface.Post.Goods.Receipt.PWS.To.CDM/Integration.Account/Test/PostGoodsReceipt_SOAP.xml

<s0:Envelope xmlns:s0="http://schemas.xmlsoap.org/soap/envelope/">
  <s0:Header />
  <s0:Body>
    <ns0:PostGoodsReceipt xmlns:ns0="http://linfoxintegration.com/horizon/postgoodsreceipt/1.0">
      <ns0:MessageHeader>
        <ns0:ID>TS01</ns0:ID>
        <ns0:CreationDate>1999-05-31T13:20:00.000-05:00</ns0:CreationDate>
        <ns0:GLNCode>22868</ns0:GLNCode>
        <ns0:CustomerName>Belkin</ns0:CustomerName>
        <ns0:WarehouseLocationCode>AU</ns0:WarehouseLocationCode>
        <ns0:TestIndicator>T</ns0:TestIndicator>
      </ns0:MessageHeader>
      <ns0:GRHeader>
        <ns0:WMSDocNumber>0000000545</ns0:WMSDocNumber>
        <ns0:PrmCustDocRefNo>HDMU2665898</ns0:PrmCustDocRefNo>
        <ns0:PrimCustDocType>SH</ns0:PrimCustDocType>
        <ns0:GRType>GRType_0</ns0:GRType>
        <ns0:AddnRefNumber1>AddnRefNumber1_0</ns0:AddnRefNumber1>
        <ns0:AddnRefNumber2>AddnRefNumber2_0</ns0:AddnRefNumber2>
        <ns0:AddnRefNumber3>AddnRefNumber3_0</ns0:AddnRefNumber3>
        <ns0:GRDate>01230123</ns0:GRDate>
        <ns0:GRTime>171033</ns0:GRTime>
        <ns0:WayBillID>WayBillID_0</ns0:WayBillID>
        <ns0:ContainerID>ContainerID_0</ns0:ContainerID>
      </ns0:GRHeader>
      <ns0:GRItemLevel>
        <ns0:GRItem>
          <ns0:WMSDeliveryLineItem>1</ns0:WMSDeliveryLineItem>
          <ns0:PrmCustOrderNumber>RE7000-ME</ns0:PrmCustOrderNumber>
          <ns0:PrmCustOrderLineItmNumber>10</ns0:PrmCustOrderLineItmNumber>
          <ns0:AddnRefNumber1>AddnRefNumber1_0</ns0:AddnRefNumber1>
          <ns0:AddnRefNumber2>AddnRefNumber2_0</ns0:AddnRefNumber2>
          <ns0:AddnRefNumber3>1349898</ns0:AddnRefNumber3>
          <ns0:AddnRefNumber4>7.1</ns0:AddnRefNumber4>
          <ns0:AddnRefNumber5>AddnRefNumber5_0</ns0:AddnRefNumber5>
          <ns0:MaterialCode>MaterialCode_0</ns0:MaterialCode>
          <ns0:MaterialName>MaterialName_0</ns0:MaterialName>
          <ns0:GTINCode>GTINCode_0</ns0:GTINCode>
          <ns0:StockCategory>
            <ns0:StockCategoryType>SG</ns0:StockCategoryType>
            <ns0:Quantity>125</ns0:Quantity>
            <ns0:QuantityUOM>EA</ns0:QuantityUOM>
            <ns0:BatchDetails>
              <ns0:Batch>
                <ns0:VendorBatchCode>VendorBatchCode_0</ns0:VendorBatchCode>
                <ns0:WMSBatchCode>WMSBatchCode_0</ns0:WMSBatchCode>
                <ns0:SLEDorBBD>1999-05-31</ns0:SLEDorBBD>
                <ns0:ManufacturingDate>1999-05-31</ns0:ManufacturingDate>
              </ns0:Batch>
              <ns0:Batch>
                <ns0:VendorBatchCode>VendorBatchCode_0</ns0:VendorBatchCode>
                <ns0:WMSBatchCode>WMSBatchCode_0</ns0:WMSBatchCode>
                <ns0:SLEDorBBD>1999-05-31</ns0:SLEDorBBD>
                <ns0:ManufacturingDate>1999-05-31</ns0:ManufacturingDate>
              </ns0:Batch>
              <ns0:Batch>
                <ns0:VendorBatchCode>VendorBatchCode_0</ns0:VendorBatchCode>
                <ns0:WMSBatchCode>WMSBatchCode_0</ns0:WMSBatchCode>
                <ns0:SLEDorBBD>1999-05-31</ns0:SLEDorBBD>
                <ns0:ManufacturingDate>1999-05-31</ns0:ManufacturingDate>
              </ns0:Batch>
            </ns0:BatchDetails>
            <ns0:SerialNumberDetails>
              <ns0:SerialNumber>10</ns0:SerialNumber>
              <ns0:SerialNumber>10</ns0:SerialNumber>
              <ns0:SerialNumber>10</ns0:SerialNumber>
            </ns0:SerialNumberDetails>
          </ns0:StockCategory>
        </ns0:GRItem>
        <ns0:GRItem>
          <ns0:WMSDeliveryLineItem>2</ns0:WMSDeliveryLineItem>
          <ns0:PrmCustOrderNumber>RE7000-KE</ns0:PrmCustOrderNumber>
          <ns0:PrmCustOrderLineItmNumber>10</ns0:PrmCustOrderLineItmNumber>
          <ns0:AddnRefNumber1>AddnRefNumber1_0</ns0:AddnRefNumber1>
          <ns0:AddnRefNumber2>AddnRefNumber2_0</ns0:AddnRefNumber2>
          <ns0:AddnRefNumber3>1349894</ns0:AddnRefNumber3>
          <ns0:AddnRefNumber4>3.1</ns0:AddnRefNumber4>
          <ns0:AddnRefNumber5>AddnRefNumber5_0</ns0:AddnRefNumber5>
          <ns0:MaterialCode>MaterialCode_0</ns0:MaterialCode>
          <ns0:MaterialName>MaterialName_0</ns0:MaterialName>
          <ns0:GTINCode>GTINCode_0</ns0:GTINCode>
          <ns0:StockCategory>
            <ns0:StockCategoryType>SG</ns0:StockCategoryType>
            <ns0:Quantity>125</ns0:Quantity>
            <ns0:QuantityUOM>EA</ns0:QuantityUOM>
            <ns0:BatchDetails>
              <ns0:Batch>
                <ns0:VendorBatchCode>VendorBatchCode_0</ns0:VendorBatchCode>
                <ns0:WMSBatchCode>WMSBatchCode_0</ns0:WMSBatchCode>
                <ns0:SLEDorBBD>1999-05-31</ns0:SLEDorBBD>
                <ns0:ManufacturingDate>1999-05-31</ns0:ManufacturingDate>
              </ns0:Batch>
              <ns0:Batch>
                <ns0:VendorBatchCode>VendorBatchCode_0</ns0:VendorBatchCode>
                <ns0:WMSBatchCode>WMSBatchCode_0</ns0:WMSBatchCode>
                <ns0:SLEDorBBD>1999-05-31</ns0:SLEDorBBD>
                <ns0:ManufacturingDate>1999-05-31</ns0:ManufacturingDate>
              </ns0:Batch>
              <ns0:Batch>
                <ns0:VendorBatchCode>VendorBatchCode_0</ns0:VendorBatchCode>
                <ns0:WMSBatchCode>WMSBatchCode_0</ns0:WMSBatchCode>
                <ns0:SLEDorBBD>1999-05-31</ns0:SLEDorBBD>
                <ns0:ManufacturingDate>1999-05-31</ns0:ManufacturingDate>
              </ns0:Batch>
            </ns0:BatchDetails>
            <ns0:SerialNumberDetails>
              <ns0:SerialNumber>10</ns0:SerialNumber>
              <ns0:SerialNumber>10</ns0:SerialNumber>
              <ns0:SerialNumber>10</ns0:SerialNumber>
            </ns0:SerialNumberDetails>
          </ns0:StockCategory>
        </ns0:GRItem>
      </ns0:GRItemLevel>
      <ns0:HandlingUnitDetails>
        <ns0:HandlingUnit>
          <ns0:HUNumber>10</ns0:HUNumber>
          <ns0:PackagingMaterialType>PackagingMaterialType_0</ns0:PackagingMaterialType>
          <ns0:PackagingMaterialName>PackagingMaterialName_0</ns0:PackagingMaterialName>
          <ns0:GrossWeightOfHandlingUnit>10.4</ns0:GrossWeightOfHandlingUnit>
          <ns0:NetWeightOfHandlingUnit>10.4</ns0:NetWeightOfHandlingUnit>
          <ns0:WeightUOMOfHandlingUnit>WeightUOMOfHandlingUnit_0</ns0:WeightUOMOfHandlingUnit>
          <ns0:HULine>
            <ns0:WMSDeliveryNumber>WMSDeliveryNumber_0</ns0:WMSDeliveryNumber>
            <ns0:WMSDeliveryLineItem>125</ns0:WMSDeliveryLineItem>
            <ns0:PrmCustOrderNumber>PrmCustOrderNumber_0</ns0:PrmCustOrderNumber>
            <ns0:PrmCustOrderLineItmNumber>10</ns0:PrmCustOrderLineItmNumber>
            <ns0:MaterialCode>MaterialCode_0</ns0:MaterialCode>
            <ns0:StockCategory>
              <ns0:StockCategoryType>StockCategoryType_0</ns0:StockCategoryType>
              <ns0:Quantity>125</ns0:Quantity>
              <ns0:QuantityUOM>QuantityUOM_0</ns0:QuantityUOM>
              <ns0:BatchDetails>
                <ns0:Batch>
                  <ns0:VendorBatchCode>VendorBatchCode_0</ns0:VendorBatchCode>
                  <ns0:WMSBatchCode>WMSBatchCode_0</ns0:WMSBatchCode>
                  <ns0:SLEDorBBD>1999-05-31</ns0:SLEDorBBD>
                  <ns0:ManufacturingDate>1999-05-31</ns0:ManufacturingDate>
                </ns0:Batch>
                <ns0:Batch>
                  <ns0:VendorBatchCode>VendorBatchCode_0</ns0:VendorBatchCode>
                  <ns0:WMSBatchCode>WMSBatchCode_0</ns0:WMSBatchCode>
                  <ns0:SLEDorBBD>1999-05-31</ns0:SLEDorBBD>
                  <ns0:ManufacturingDate>1999-05-31</ns0:ManufacturingDate>
                </ns0:Batch>
                <ns0:Batch>
                  <ns0:VendorBatchCode>VendorBatchCode_0</ns0:VendorBatchCode>
                  <ns0:WMSBatchCode>WMSBatchCode_0</ns0:WMSBatchCode>
                  <ns0:SLEDorBBD>1999-05-31</ns0:SLEDorBBD>
                  <ns0:ManufacturingDate>1999-05-31</ns0:ManufacturingDate>
                </ns0:Batch>
              </ns0:BatchDetails>
              <ns0:SerialNumberDetails>
                <ns0:SerialNumber>10</ns0:SerialNumber>
                <ns0:SerialNumber>10</ns0:SerialNumber>
                <ns0:SerialNumber>10</ns0:SerialNumber>
              </ns0:SerialNumberDetails>
            </ns0:StockCategory>
          </ns0:HULine>
        </ns0:HandlingUnit>
      </ns0:HandlingUnitDetails>
    </ns0:PostGoodsReceipt>
  </s0:Body>
</s0:Envelope>